Revit 2027 API
DGNExportOptions.GetPredefinedOptions Method
 Returns an instance DGNExportOptions containing settings from a predefined export setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DGNExportOptions GetPredefinedOptions(
	Document document,
	string setup
)
Public Shared Function GetPredefinedOptions (
	document As Document,
	setup As String
) As DGNExportOptions
public:
static DGNExportOptions^ GetPredefinedOptions(
	Document^ document,
	String^ setup
)
static member GetPredefinedOptions :
        document : Document *
        setup : string -> DGNExportOptions
Parameters
document Document
 A Revit project document to retrieve the setup from.
setup String
 The name of a predefined export setup from the specified document.
Return Value
DGNExportOptions
 An instance of predefined DGNExportOptions, or null if the name was not found.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace